package com.example;

import com.example.Pojo.Page;
import com.example.service.impl.IPagesServiceImpl;
import org.junit.jupiter.api.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

@SpringBootTest
class SpringBootLastApplicationTests {

    @Autowired
    private IPagesServiceImpl iPagesService;

    @Test
    void contextLoads() {
        Page page = new Page();
        page.setUserid(1);
        page.setUsername("李四");
        page.setDate("2002-03-03");
        page.setTitle("see you again");
        page.setContent("君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停会须一饮三百杯岑夫子，丹丘生，将进酒，杯莫停");
        iPagesService.save(page);
    }

}
